app/views/men/index.html.erb

          if (localStorage.getItem(<%=man.product.id%>) !== null){
            document.getElementById(<%=man.product.id%>).value = "Saved";
---
SELECT "men".* FROM "men"
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]