app/views/users/show.html.erb

SELECT  1 AS one FROM "newsletters" WHERE "newsletters"."email" = $1 LIMIT $2  [["email", "notsimondean@gmail.com"], ["LIMIT", 1]]
---

  <% if Newsletter.exists?(email: @user.email) %>