PHISH/app/views/home/index.html.erb

SELECT "products".* FROM "products" WHERE ("products"."popularityScore" >= ?) ORDER BY popularityScore DESC  [["popularityScore", 5.0]]
---

<%@popular = Product.order('popularityScore DESC')%>