app/views/home/index.html.erb

<%# <%@popular = popular.order('popularityScore DESC')%>
<% @popular = Product.where(popularityScore: 5..100) %>
---
SELECT "products".* FROM "products" WHERE "products"."popularityScore" >= $1 ORDER BY popularityScore DESC  [["popularityScore", 5.0]]