app/views/home/savedlist.html.erb

    </script>
    <%@products = Product.all%>
---
SELECT "products".* FROM "products"