app/views/carts/index.html.erb

<h1>Your Cart</h1>
<%@user = User.find(session[:user_id])%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    <div class="product-removal">
      <%= button_to 'Remove', Cart.find_by(id: item.id) , method: :delete, data: { confirm: 'Are you sure?' } %>
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]