PHISH/app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("product_id", "user_id", "size", "colour", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 2], ["user_id", 1], ["size", "Medium"], ["colour", "White"], ["quantity", 1], ["created_at", "2021-05-24 06:07:11.738596"], ["updated_at", "2021-05-24 06:07:11.738596"]]

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]