PHISH/app/controllers/products_controller.rb

    def set_product
      @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]