PHISH/app/views/layouts/_headerbar.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%if session[:user_id]
  @user = User.find(session[:user_id])