PHISH/app/views/carts/index.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          if (localStorage.getItem(<%=item.product.id%>) !== null){
            document.getElementById(<%=item.product.id%>).value = "Saved";