app/views/layouts/_headerbar.html.erb

<%if session[:user_id]
  @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]