app/views/layouts/_topbanner.html.erb

SELECT  "products".* FROM "products" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
<%@product=Product.order('RANDOM()').first%>